// *********************************
// 제 목  : 실습과제4
// 날 짜  : 2026년 3월 12일
// 작성자 : 2603043 한정우
// *********************************

#include <iostream>


using namespace std;

int main() {
	double arr[5] = { 0 };		// 사용자의 입력을 받을 배열 선언
	double total = 0.0;			// 양수의 합을 나타낼 변수 선언
	cout << "실수 5개를 입력하세요>>";
	for (int i = 0; i < sizeof(arr) / sizeof(arr[0]); i++) {  // 배열의 수만큼 입력받도록 for 반복문 사용 + 유지보수 관점에서 
															  // 배열의 길이가 바뀔 경우 for문은 바꾸지 않아도 되도록 수식 추가
		cin >> arr[i];			//입력받은 값을 각 배열마다 저장

		if (arr[i] > 0) {	   // 음수일 경우 값을 더하지 않도록 조건문 추가
			total += arr[i];
		}
	}

	cout << "양수 합은 " << total << "입니다." << endl;

	return 0;
}