// *******************************************
// 제목: 실습 과제2
// 날짜: 26년 3월 12일
// 작성자: 2603043 한정우
// *******************************************

#include <iostream>

using namespace std;

// 메모리 관점에선 cout 를 한번만 출력하는 것이 좋지만 cout 의 경우는 메모리를 크게 낭비하지 않고 
// 한번에 출력할 경우 가독성이 떨어지기 때문에 유지보수의 관점에서 나누어 출력하는 것으로 변경하였습니다.
// 중요한 것은 endl 의 수이며 시스템 자원을 효율적으로 사용하기 위해 endl 을 마지막에 한번만 사용했습니다
int main() {

    cout << "군산대학교 \"홍길동\"\n";

    cout << "\"축하합니다.\"\n";

    cout << "100% \\취업률\\" << endl;

    return 0;

}
