// ********************************************
// 제 목 : 화면에 "Hello" 문자열 출력
// 날 짜 : 2026년 3월 5일
// 작성자 : 2603043 한정우
// ********************************************

#include <iostream>   // 전처리기 지시자: 표준 입출력 스트림을 위한 헤더 파일을 포함합니다.


int main() {   // main 함수: 프로그램의 실행이 시작되는 진입점
    // 표준 출력 : std 네임스페이스의 cout 객체와 삽입 연산자(<< )를 사용하여
    // "Hello"라는 문자열 리터럴을 콘솔(표준 출력 장치)로 전달합니다.
    std::cout << "Hello";  //

    // 반환문: 함수를 종료하며 호출자인 운영체제(OS)에 정상 종료 상태(0)를 반환합니다.
    return 0;
}
