// *******************************************
// 제목: 실습 과제4
// 날짜: 26년 3월 12일
// 작성자: 2603043 한정우
// *******************************************

#include <iostream> 

using namespace std;

int main() {
    // 외곽 반복문: 행(Row)을 제어 (0부터 6까지 총 7줄)
    for (int i = 0; i < 7; i++) {
        // 내부 반복문: 열(Column)을 제어 (0부터 6까지 총 7칸)
        for (int j = 0; j < 7; j++) {

            /* 조건문: 별(*)이 찍힐 좌표를 결정
               1. i == j : 왼쪽 위에서 오른쪽 아래로 내려가는 '주 대각선'
               2. i + j == 6 : 오른쪽 위에서 왼쪽 아래로 내려가는 '부 대각선'
               (전체 크기가 7이므로 인덱스 합이 6인 지점이 대각선임)
               => X 자를 만들어야하므로 이렇게 지정
            */
            if (i == j || i + j == 6) {
                cout << "*"; // 조건에 해당하면 별 출력
            }
            else {
                cout << " "; // 조건에 해당하지 않으면 공백 출력
            }
        }

        cout << "\n";        // 한 행이 끝나면 줄바꿈
    }

    return 0; // 프로그램 정상 종료

}

